app/Http/Controllers/UserController.php

    public function addUser()
    {

        $data = [
            'role' => Role::select('id', 'name')->get(),
        ];
---
SELECT `id`, `name` FROM `roles`

    public function edit(string $id)
    {
        $currentData = User::with('role')->select('id', 'username', 'email', 'role_id', 'name')->find($id);
        $data = [
            'editData' => $currentData,
            'role' => Role::select('id', 'name')->get(),
---
SELECT * FROM `roles` WHERE `roles`.`id` in (1)
SELECT `id`, `username`, `email`, `role_id`, `name` FROM `users` WHERE `users`.`id` = '3' LIMIT 1
SELECT `id`, `name` FROM `roles`

    public function update(StoreUserRequest $request, string $id)
    {
        $validated = $request->validated();
        // $user = User::updateOrCreate(
        //     ['email' => $request->email], // kriteria untuk mencari data
        //     $request->validated()         // data untuk update atau create
        // );
        $user = User::findOrFail($id);
---
SELECT * FROM `users` WHERE `users`.`id` = '2' LIMIT 1

    public function destroy(string $id)
    {
        User::find($id)->delete();
---
DELETE FROM `users` WHERE `id` = 15
SELECT * FROM `users` WHERE `users`.`id` = '15' LIMIT 1